Revit 2027 API
IFCUserDefinedPropertySet.PropertySetType Property
 The user-defined property set type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IFCUserDefinedPropertySetType PropertySetType { get; set; }
Public Property PropertySetType As IFCUserDefinedPropertySetType
	Get
	Set
public:
property IFCUserDefinedPropertySetType PropertySetType {
	IFCUserDefinedPropertySetType get ();
	void set (IFCUserDefinedPropertySetType value);
}
member PropertySetType : IFCUserDefinedPropertySetType with get, set
Property Value
IFCUserDefinedPropertySetType
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace